In [11]:
import pandas as pd

In [18]:
data = {
        "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns=columns)
df.index.name = "도시"
df.columns.name = "특성"

In [19]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [30]:
data2 = {
    '체력' : [100,200,152,236,444,555],
    '힘' : [12.7,5.8,8.9,8.7,5.6,4.3],
    '민첩' : [13,15,46,85,2,32],
    '명성' : ['모름', '보통', '유명', '유명', '모름', '보통']
}
    
df2 = pd.DataFrame(data2, index=['전사', '마법사', '도적', '사제', '드루이드', '엘프'])
df2.columns.name= '특성'
df2.index.name= '캐릭터'
df2.name= '목록'

In [31]:
df2

특성     체력     힘  민첩  명성
캐릭터
전사    100  12.7  13  모름
마법사   200   5.8  15  보통
도적    152   8.9  46  유명
사제    236   8.7  85  유명
드루이드  444   5.6   2  모름
엘프    555   4.3  32  보통

In [33]:
df2.values

array([[100, 12.7, 13, '모름'],
       [200, 5.8, 15, '보통'],
       [152, 8.9, 46, '유명'],
       [236, 8.7, 85, '유명'],
       [444, 5.6, 2, '모름'],
       [555, 4.3, 32, '보통']], dtype=object)

In [34]:
df2.columns

Index(['체력', '힘', '민첩', '명성'], dtype='object', name='특성')

In [35]:
df2.index

Index(['전사', '마법사', '도적', '사제', '드루이드', '엘프'], dtype='object', name='캐릭터')

In [37]:
df2.describe()

특성             체력          힘         민첩
count    6.000000   6.000000   6.000000
mean   281.166667   7.666667  32.166667
std    178.680068   3.066377  30.182224
min    100.000000   4.300000   2.000000
25%    164.000000   5.650000  13.500000
50%    218.000000   7.250000  23.500000
75%    392.000000   8.850000  42.500000
max    555.000000  12.700000  85.000000

In [39]:
df2[['체력', '민첩']]

특성     체력  민첩
캐릭터
전사    100  13
마법사   200  15
도적    152  46
사제    236  85
드루이드  444   2
엘프    555  32

In [41]:
df2[['체력']]

특성     체력
캐릭터
전사    100
마법사   200
도적    152
사제    236
드루이드  444
엘프    555

In [54]:
df2['명성']['도적']

'유명'

In [89]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
dfp = pd.DataFrame(data, index=index, columns=columns)

In [73]:
dfp

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [57]:
dfp['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [58]:
dfp[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [77]:
dfp['평균'] = ((dfp['국어'] + dfp['영어'] + dfp['수학']) / 3).round(2)
dfp

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [92]:
dfp['영어']['방자'] = 80

80

In [93]:
dfp['평균'] = ((dfp['국어'] + dfp['영어'] + dfp['수학']) / 3).round(2)
dfp

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [94]:
dfp[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [99]:
dfp.loc["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64